services/task-service/app/controllers/api/v1/tasks_controller.rb

  def create
    @task = current_user_tasks.build(task_params)

    if @task.save
---
INSERT INTO "tasks" ("title", "description", "status", "priority", "user_id", "due_date", "completed_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["title", "수정된 태스크"], ["description", "수정된 설명"], ["updated_at", "2025-08-27 04:46:37.742104"], ["id", 38]]

  def destroy
    if @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 38]]

  def update_status
    unless params[:status].present?
      return render json: { error: "Status parameter is required" }, status: :bad_request
    end

    begin
      @task.update_status!(params[:status])
---
UPDATE "tasks" SET "status" = $1, "completed_at" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["status", "completed"], ["completed_at", "2025-08-16 13:47:47.206593"], ["updated_at", "2025-08-16 13:47:47.206617"], ["id", 37]]

  def complete
    begin
      @task.update_status!("completed")
---
UPDATE "tasks" SET "status" = $1, "completed_at" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["status", "completed"], ["completed_at", "2025-08-27 12:17:48.790367"], ["updated_at", "2025-08-27 12:17:48.790412"], ["id", 2]]

  def bulk_update
    unless params[:task_ids].present? && params[:updates].present?
      return render json: {
        error: "task_ids and updates parameters are required"
      }, status: :bad_request
    end

    task_ids = params[:task_ids]
    updates = params[:updates].permit(:status, :priority, :due_date, :description)

    # Validate task ownership
    tasks = current_user_tasks.where(id: task_ids)

    if tasks.count != task_ids.length
      return render json: {
        error: "Some tasks not found or not owned by user"
      }, status: :not_found
    end

    # Perform bulk update
    success_count = 0
    failure_count = 0
    errors = []

    tasks.each do |task|
      begin
        if updates[:status].present? && updates[:status] != task.status
          task.update_status!(updates[:status])
---
UPDATE "tasks" SET "description" = $1, "priority" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["description", "Updated description"], ["priority", "high"], ["updated_at", "2025-08-27 08:12:13.793732"], ["id", 50]]